import { Text } from './text'

export const startText = (invitedByName?: string): Text => {
  return {
    text: `
Привіт 👋
Цей бот друкує наліпки з Телеграму, просто як ніколи.
${
  invitedByName
    ? `\n👫 Тебе запросив(ла) ${invitedByName}! Як тільки ти зробиш перше замовлення, ви удвох отримаєте по 3 безкоштовних стікера!\n`
    : ''
}
*Як це працює*
1️⃣ Надсилаєш боту свої улюблені наліпки.
2️⃣ Вводиш адресу доставки і номер телефону.
3️⃣ Обираєш спосіб оплати.
4️⃣ Ми друкуємо твої наліпки і відправляємо Новою Поштою.

👫 *Запроси друга*
І ви удвох отримаєте по *3* безкоштовних наліпки 🔥

🇺🇦 *10%* прибутку донатимо ЗСУ!

Давай зробимо перше замовлення! Тисни на кнопку нижче 👇
`,
    parseMode: 'Markdown',
  }
}
