import { Text } from './text'

export const successfulPaymentText = (invitedByUserName?: string): Text => {
  return {
    text: `
✅ Оплата пройшла успішно! Замовлення оформлене і буде відправлено до кінця наступного робочого тижня.

ℹ️ Ви можете переглянути статус замовлення на сторінці “✉️ *Мої замовлення*”.

А зараз повертаємось у головне меню 👇
`,
    parseMode: 'Markdown',
  }
}

// export const successfulPaymentText = (invitedByUserName?: string): Text => {
//   return {
//     text: `
// ✅ Оплата пройшла успішно! Замовлення оформлене і буде відправлено до кінця наступного робочого тижня.

// ℹ️ Ти можеш переглянути статус замовлення на сторінці “✉️ *Мої замовлення*”.

// ${
//   invitedByUserName
//     ? `🎉 Оскільки це було замовлення за реферальним посиланням, ти і ${invitedByUserName} отримуєте по 3 безкоштовних наліпки! (Кількість безкоштовних наліпок можна подивитись на сторінці “👫 *Запросити друзів*”)`
//     : ''
// }

// А зараз повертаємось у головне меню 👇
// `,
//     parseMode: 'Markdown',
//   }
// }
